#11. Напишите программу, которая приветствует пользователя, выводя слово `Hello`, введенное имя и знаки препинания
#по образцу: `Hello Kitty!`

name = input("Введите ваше имя\n")
print('Hello ', name, '!')

